import React from 'react';
import { Dialog, DialogTitle, DialogContent, Typography, Button } from '@mui/material';

interface HelpModalProps {
  open: boolean;
  onClose: () => void;
}

const HelpModal: React.FC<HelpModalProps> = ({ open, onClose }) => {
  return (
    <Dialog open={open} onClose={onClose}>
      <DialogTitle>Довідка</DialogTitle>
      <DialogContent>
        <Typography gutterBottom>
          Основні терміни теорії управління:
          <ul>
            <li><strong>Передавальна функція:</strong> Математичний опис системи управління, який представляє залежність виходу системи від входу у формі відношення поліномів.</li>
            <li><strong>Стабільність:</strong> Властивість системи, за якої її вихід залишається обмеженим при обмежених вхідних сигналах.</li>
            <li><strong>Критерій Найквіста:</strong> Графічний метод аналізу стабільності систем, який використовує контур в комплексній площині частотної характеристики системи.</li>
            <li><strong>Критерій Боде:</strong> Графічний метод, що використовується для аналізу частотної відповіді системи, представлений у вигляді графіків амплітуди та фази.</li>
            <li><strong>Раут-Гурвіц:</strong> Алгебраїчний метод для перевірки стабільності системи, що базується на властивостях розміщення коренів характеристичного рівняння.</li>
          </ul>
        </Typography>
        <Typography gutterBottom>
          Як використовувати сервіс:
          <ul>
            <li><strong>Введення даних:</strong> Введіть чисельник і знаменник передавальної функції у відповідні поля. Використовуйте формат, де коефіцієнти розділені комами. Наприклад, для чисельника "1, 3, 5" та знаменника "2, 4, 6".</li>
            <li><strong>Запуск аналізу:</strong> Після введення даних натисніть кнопку "Аналізувати". Система обробить введені дані та покаже результати на графіках Найквіста та Боде, а також виведе текстовий висновок про стабільність системи.</li>
            <li><strong>Експорт результатів:</strong> Ви можете експортувати результати аналізу в PDF-файл, натиснувши кнопку "Експортувати в PDF".</li>
            <li><strong>Довідка:</strong> Для отримання додаткової інформації про терміни та використання сервісу скористайтеся кнопкою довідки в правому верхньому куті.</li>
          </ul>
        </Typography>
      </DialogContent>
      <Button onClick={onClose} style={{padding: '16px 0'}} color="primary">Закрити</Button>
    </Dialog>
  );
};

export default HelpModal;
